package com.ddbb.utils;

import java.util.ArrayList;
import java.util.List;
import java.util.concurrent.ThreadLocalRandom;

public class ProfileGenerator {
    private static String text1 = "君不见黄河之水天上来奔流到海不复回君不见高堂明镜悲白发朝如青丝暮成雪人生得意须尽欢" +
            "莫使金樽空对月天生我材必有用千金散尽还复来烹羊宰牛且为乐会须一饮三百杯岑夫子丹丘生将进酒杯莫停与君歌一曲" +
            "请君为我倾耳听钟鼓馔玉不足贵但愿长醉不复醒古来圣贤皆寂寞惟有饮者留其名陈王昔时宴平乐斗酒十千恣欢谑主人何为言少钱" +
            "径须沽取对君酌五花马千金裘呼儿将出换美酒与尔同销万古愁";
    private static String text2 = "黄初三年余朝京师还济洛川古人有言斯水之神名曰宓妃感宋玉对楚王神女之事遂作斯赋其辞曰" +
            "余从京域言归东藩背伊阙越轘辕经通谷陵景山日既西倾车殆马烦尔乃税驾乎蘅皋秣驷乎芝田容与乎阳林流眄乎洛川" +
            "于是精移神骇忽焉思散俯则未察仰以殊观睹一丽人于岩之畔乃援御者而告之曰尔有觌于彼者乎彼何人斯若此之艳也御者对曰" +
            "臣闻河洛之神名曰宓妃然则君王之所见也无乃是乎其状若何臣愿闻之余告之曰其形也翩若惊鸿婉若游龙荣曜秋菊华茂春松" +
            "髣髴兮若轻云之蔽月飘飖兮若流风之回雪远而望之皎若太阳升朝霞迫而察之灼若芙蕖出渌波秾纤得衷修短合度肩若削成腰如约素" +
            "延颈秀项皓质呈露芳泽无加铅华弗御云髻峨峨修眉联娟丹唇外朗皓齿内鲜明眸善睐靥辅承权瑰姿艳逸仪静体闲柔情绰态" +
            "媚于语言奇服旷世骨像应图披罗衣之璀粲兮珥瑶碧之华琚戴金翠之首饰缀明珠以耀躯践远游之文履曳雾绡之轻裾微幽兰之芳蔼兮" +
            "步踟蹰于山隅于是忽焉纵体以遨以嬉左倚采旄右荫桂旗攘皓腕于神浒兮采湍濑之玄芝余情悦其淑美兮心振荡而不怡无良媒以接欢兮" +
            "托微波而通辞愿诚素之先达兮解玉佩以要之嗟佳人之信修兮羌习礼而明诗抗琼珶以和予兮指潜渊而为期执眷眷之款实兮惧斯灵之我欺" +
            "感交甫之弃言兮怅犹豫而狐疑收和颜而静志兮申礼防以自持于是洛灵感焉徙倚彷徨神光离合乍阴乍阳竦轻躯以鹤立若将飞而未翔" +
            "践椒涂之郁烈步蘅薄而流芳超长吟以永慕兮声哀厉而弥长尔乃众灵杂沓命俦啸侣或戏清流或翔神渚或采明珠或拾翠羽" +
            "从南湘之二妃携汉滨之游女叹匏瓜之无匹兮咏牵牛之独处扬轻袿之猗靡兮翳修袖以延伫体迅飞凫飘忽若神凌波微步罗袜生尘" +
            "动无常则若危若安进止难期若往若还转眄流精光润玉颜含辞未吐气若幽兰华容婀娜令我忘餐于是屏翳收风川后静波冯夷鸣鼓" +
            "女娲清歌腾文鱼以警乘鸣玉鸾以偕逝六龙俨其齐首载云车之容裔鲸鲵踊而夹毂水禽翔而为卫于是越北沚过南冈纡素领回清阳" +
            "动朱唇以徐言陈交接之大纲恨人神之道殊兮怨盛年之莫当抗罗袂以掩涕兮泪流襟之浪浪悼良会之永绝兮哀一逝而异乡无微情以效爱兮" +
            "献江南之明珰虽潜处于太阴长寄心于君王忽不悟其所舍怅神宵而蔽光于是背下陵高足往神留遗情想像顾望怀愁冀灵体之复形" +
            "御轻舟而上溯浮长川而忘返思绵绵而增慕夜耿耿而不寐沾繁霜而至曙命仆夫而就驾吾将归乎东路揽騑辔以抗策怅盘桓而不能去";

    private static String text3 = "庆历四年春滕子京谪守巴陵郡越明年政通人和百废具兴乃重修岳阳楼增其旧制刻唐贤今人诗赋于其上" +
            "属予作文以记之予观夫巴陵胜状在洞庭一湖衔远山吞长江浩浩汤汤横无际涯朝晖夕阴气象万千此则岳阳楼之大观也前人之述备矣" +
            "然则北通巫峡南极潇湘迁客骚人多会于此览物之情得无异乎若夫淫雨霏霏连月不开阴风怒号浊浪排空日星隐曜山岳潜形" +
            "商旅不行樯倾楫摧薄暮冥冥虎啸猿啼登斯楼也则有去国怀乡忧谗畏讥满目萧然感极而悲者矣至若春和景明波澜不惊上下天光" +
            "一碧万顷沙鸥翔集锦鳞游泳岸芷汀兰郁郁青青而或长烟一空皓月千里浮光跃金静影沉璧渔歌互答此乐何极登斯楼也" +
            "则有心旷神怡宠辱偕忘把酒临风其喜洋洋者矣嗟夫予尝求古仁人之心或异二者之为何哉不以物喜不以己悲居庙堂之高则忧其民" +
            "处江湖之远则忧其君是进亦忧退亦忧然则何时而乐耶其必曰先天下之忧而忧后天下之乐而乐乎噫微斯人吾谁与归" +
            "时六年九月十五日";

    private static String text4 = "晋太元中武陵人捕鱼为业缘溪行忘路之远近忽逢桃花林夹岸数百步中无杂树芳草鲜美落英缤纷" +
            "渔人甚异之复前行欲穷其林林尽水源便得一山山有小口仿佛若有光便舍船从口入初极狭才通人复行数十步豁然开朗" +
            "土地平旷屋舍俨然有良田、美池、桑竹之属阡陌交通鸡犬相闻其中往来种作男女衣着悉如外人黄发垂髫并怡然自乐见渔人" +
            "乃大惊问所从来具答之便要还家设酒杀鸡作食村中闻有此人咸来问讯自云先世避秦时乱率妻子邑人来此绝境不复出焉" +
            "遂与外人间隔问今是何世乃不知有汉无论魏晋此人一一为具言所闻皆叹惋余人各复延至其家皆出酒食停数日辞去" +
            "此中人语云不足为外人道也既出得其船便扶向路处处志之及郡下诣太守说如此太守即遣人随其往寻向所志遂迷" +
            "不复得路南阳刘子骥高尚士也闻之欣然规往未果寻病终后遂无问津者";
    private static String text5 = "环滁皆山也其西南诸峰林壑尤美望之蔚然而深秀者琅琊也山行六七里渐闻水声潺潺而泻出于两峰之间者" +
            "酿泉也峰回路转有亭翼然临于泉上者醉翁亭也作亭者谁山之僧智仙也名之者谁太守自谓也太守与客来饮于此饮少辄醉而年又最高" +
            "故自号曰醉翁也醉翁之意不在酒在乎山水之间也山水之乐得之心而寓之酒也若夫日出而林霏开云归而岩穴暝晦明变化者山间之朝暮也" +
            "野芳发而幽香佳木秀而繁阴风霜高洁水落而石出者山间之四时也朝而往暮而归四时之景不同而乐亦无穷也至于负者歌于途" +
            "行者休于树前者呼后者应伛偻提携往来而不绝者滁人游也临溪而渔溪深而鱼肥酿泉为酒泉香而酒洌山肴野蔌杂然而前陈者" +
            "太守宴也宴酣之乐非丝非竹射者中弈者胜觥筹交错起坐而喧哗者众宾欢也苍颜白发颓然乎其间者太守醉也已而夕阳在山" +
            "人影散乱太守归而宾客从也树林阴翳鸣声上下游人去而禽鸟乐也然而禽鸟知山林之乐而不知人之乐人知从太守游而乐" +
            "而不知太守之乐其乐也醉能同其乐醒能述以文者太守也太守谓谁庐陵欧阳修也";

    private static List<String> list1 = new ArrayList<>();
    private static List<String> list2 = new ArrayList<>();
    private static List<String> list3 = new ArrayList<>();
    private static List<String> list4 = new ArrayList<>();
    private static List<String> list5 = new ArrayList<>();
    private static void init(String article,List<String> list){
        for (char ch: article.toCharArray()){
            list.add(String.valueOf(ch));
        }
    }
    private static String getRandomWord(List<String> list){
        int i = ThreadLocalRandom.current().nextInt(list.size());
        return list.get(i);
    }
    static {
        init(text1,list1);
        init(text2,list2);
        init(text3,list3);
        init(text4,list4);
        init(text5,list5);
    }


    public static String getNickname(){
        StringBuffer sb = new StringBuffer(5);
        sb.append(getRandomWord(list1)).append(getRandomWord(list2)).append(getRandomWord(list3))
                .append(getRandomWord(list4)).append(getRandomWord(list5));
        return sb.toString();
    }

    public static String getAvatar(){
        return "default_avatar/"+ThreadLocalRandom.current().nextInt(20)+".png";
    }

    public static void main(String[] args) {
        for (int i =0;i<10;i++){
            System.out.println(getNickname());
        }
    }
}
